//2151753 彭坤宇 计科
#include<iostream>
#include<iomanip>
using namespace std;
int main()
{
	double a, t;
	int b, c, d, e, f, g, h, i, j, k, l, m;
	cout << "请输入[0..100亿]之间的数字" << endl;
	cin >> a;
	t = a / 10.0;
	b = int(t) / 100000000;
	c = (int(t) - 100000000 * b) / 10000000;
	d = (int(t) - 100000000 * b - 10000000 * c) / 1000000;
	e = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d) / 100000;
	f = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e) / 10000;
	g = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f) / 1000;
	h = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g) / 100;
	i = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g - 100 * h) / 10;
	j = (int(t) - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g - 100 * h - 10 * i);
	k = int((t - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g - 100 * h - 10 * i - j) * 10 + 0.001);
	l = int(((t - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g - 100 * h - 10 * i - j) * 10 - k) * 10 + 0.001);
	m = int((((t - 100000000 * b - 10000000 * c - 1000000 * d - 100000 * e - 10000 * f - 1000 * g - 100 * h - 10 * i - j) * 10 - k) * 10 - l) * 10 + 0.001);
	cout << "十亿位 ：" << b << endl;
	cout << "亿位   ：" << c << endl;
	cout << "千万位 ：" << d << endl;
	cout << "百万位 ：" << e << endl;
	cout << "十万位 ：" << f << endl;
	cout << "万位   ：" << g << endl;
	cout << "千位   ：" << h << endl;
	cout << "百位   ：" << i << endl;
	cout << "十位   ：" << j << endl;
	cout << "圆     ：" << k << endl;
	cout << "角     ：" << l << endl;
	cout << "分     ：" << m << endl;
	return 0;
}